MarlinFirmware/Marlin/buildroot/share/PlatformIO/framework-arduino-at32f4/system/Drivers/Firmware/src/at32f403a_407_flash.c
  while((status == FLASH_OPERATE_BUSY) && (time_out != 0x00))
  {
    status = flash_operation_status_get();
    time_out--;
  }
  if(time_out == 0x00)
  {
    status = FLASH_OPERATE_TIMEOUT;
  }
  /* return the status */
  return status;
}

/**
  * @brief  wait for flash bank1 operation complete or timeout.
  * @param  time_out: flash operation timeout
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_bank1_operation_wait_for(uint32_t time_out)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* check for the flash status */
  status = flash_bank1_operation_status_get();

  while((status == FLASH_OPERATE_BUSY) && (time_out != 0x00))
  {
    status = flash_bank1_operation_status_get();
    time_out--;
  }
  if(time_out == 0x00)
  {
    status = FLASH_OPERATE_TIMEOUT;
  }
  /* return the operation status */
  return status;
}

/**
  * @brief  wait for flash bank2 operation complete or timeout.
  * @param  time_out: flash operation timeout
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_bank2_operation_wait_for(uint32_t time_out)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* check for the flash status */
  status = flash_bank2_operation_status_get();

  while((status == FLASH_OPERATE_BUSY) && (time_out != 0x00))
  {
    status = flash_bank2_operation_status_get();
    time_out--;
  }
  if(time_out == 0x00)
  {
    status = FLASH_OPERATE_TIMEOUT;
  }
  /* return the operation status */
  return status;
}

/**
  * @brief  wait for flash spim operation complete or timeout.
  * @param  time_out: flash operation timeout
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_spim_operation_wait_for(uint32_t time_out)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* check for the flash status */
  status = flash_spim_operation_status_get();

  while((status == FLASH_OPERATE_BUSY) && (time_out != 0x00))
  {
    status = flash_spim_operation_status_get();
    time_out--;
  }
  if(time_out == 0x00)
  {
    status = FLASH_OPERATE_TIMEOUT;
  }
  /* return the operation status */
  return status;
}

/**
  * @brief  unlock the flash controller.
  * @param  none
  * @retval none
  */
void flash_unlock(void)
{
  FLASH->unlock = FLASH_UNLOCK_KEY1;
  FLASH->unlock = FLASH_UNLOCK_KEY2;
  FLASH->unlock2 = FLASH_UNLOCK_KEY1;
  FLASH->unlock2 = FLASH_UNLOCK_KEY2;
}

/**
  * @brief  unlock the flash bank1 controller.
  * @param  none
  * @retval none
  */
void flash_bank1_unlock(void)
{
  FLASH->unlock = FLASH_UNLOCK_KEY1;
  FLASH->unlock = FLASH_UNLOCK_KEY2;
}

/**
  * @brief  unlock the flash bank2 controller.
  * @param  none
  * @retval none
  */
void flash_bank2_unlock(void)
{
  FLASH->unlock2 = FLASH_UNLOCK_KEY1;
  FLASH->unlock2 = FLASH_UNLOCK_KEY2;
}

/**
  * @brief  unlock the flash spim controller.
  * @param  none
  * @retval none
  */
void flash_spim_unlock(void)
{
  FLASH->unlock3 = FLASH_UNLOCK_KEY1;
  FLASH->unlock3 = FLASH_UNLOCK_KEY2;
}

/**
  * @brief  lock the flash controller.
  * @param  none
  * @retval none
  */
void flash_lock(void)
{
  FLASH->ctrl_bit.oplk = TRUE;
  FLASH->ctrl2_bit.oplk = TRUE;
}

/**
  * @brief  lock the flash bank1 controller.
  * @param  none
  * @retval none
  */
void flash_bank1_lock(void)
{
  FLASH->ctrl_bit.oplk = TRUE;
}

/**
  * @brief  lock the flash bank2 controller.
  * @param  none
  * @retval none
  */
void flash_bank2_lock(void)
{
  FLASH->ctrl2_bit.oplk = TRUE;
}

/**
  * @brief  lock the flash spim controller.
  * @param  none
  * @retval none
  */
void flash_spim_lock(void)
{
  FLASH->ctrl3_bit.oplk = TRUE;
}

/**
  * @brief  erase a specified flash sector.
  * @param  sector_address: the sector address to be erased.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_sector_erase(uint32_t sector_address)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  if((sector_address >= FLASH_BANK1_START_ADDR) && (sector_address <= FLASH_BANK1_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank1_operation_wait_for(ERASE_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      /* if the previous operation is completed, continue to erase the sector */
      FLASH->ctrl_bit.secers = TRUE;
      FLASH->addr = sector_address;
      FLASH->ctrl_bit.erstr = TRUE;

      /* wait for operation to be completed */
      status = flash_bank1_operation_wait_for(ERASE_TIMEOUT);

      /* disable the secers bit */
      FLASH->ctrl_bit.secers = FALSE;
    }
  }
  else if((sector_address >= FLASH_BANK2_START_ADDR) && (sector_address <= FLASH_BANK2_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank2_operation_wait_for(ERASE_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      /* if the previous operation is completed, continue to erase the sector */
      FLASH->ctrl2_bit.secers = TRUE;
      FLASH->addr2 = sector_address;
      FLASH->ctrl2_bit.erstr = TRUE;

      /* wait for operation to be completed */
      status = flash_bank2_operation_wait_for(ERASE_TIMEOUT);

      /* disable the secers bit */
      FLASH->ctrl2_bit.secers = FALSE;
    }
  }
  /* spim : external flash */
  else if(sector_address >= FLASH_SPIM_START_ADDR)
  {
    /* wait for last operation to be completed */
    status = flash_spim_operation_wait_for(SPIM_ERASE_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      /* if the previous operation is completed, continue to erase the sector */
      FLASH->ctrl3_bit.secers = TRUE;
      FLASH->addr3 = sector_address;
      FLASH->ctrl3_bit.erstr = TRUE;

      /* wait for operation to be completed */
      status = flash_spim_operation_wait_for(SPIM_ERASE_TIMEOUT);

