MarlinFirmware/Marlin/buildroot/share/PlatformIO/framework-arduino-at32f4/system/Drivers/Firmware/src/at32f403a_407_flash.c
      /* disable the secers bit */
      FLASH->ctrl3_bit.secers = FALSE;
    }
    return status;
  }

  /* return the erase status */
  return status;
}

/**
  * @brief  erase flash all internal sectors.
  * @param  none
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_internal_all_erase(void)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* wait for last operation to be completed */
  status = flash_bank1_operation_wait_for(ERASE_TIMEOUT);

  if(status == FLASH_OPERATE_DONE)
  {
    /* if the previous operation is completed, continue to erase bank1 */
    FLASH->ctrl_bit.bankers = TRUE;
    FLASH->ctrl_bit.erstr = TRUE;

    /* wait for operation to be completed */
    status = flash_bank1_operation_wait_for(ERASE_TIMEOUT);

    /* disable the bankers bit */
    FLASH->ctrl_bit.bankers = FALSE;
  }
  if(status == FLASH_OPERATE_DONE)
  {
    /* if the previous operation is completed, continue to erase bank2 */
    FLASH->ctrl2_bit.bankers = TRUE;
    FLASH->ctrl2_bit.erstr = TRUE;

    /* wait for operation to be completed */
    status = flash_bank2_operation_wait_for(ERASE_TIMEOUT);

    /* disable the bankers bit */
    FLASH->ctrl2_bit.bankers = FALSE;
  }
  /* return the erase status */
  return status;
}

/**
  * @brief  erase flash bank1 sectors.
  * @param  none
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_bank1_erase(void)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* wait for last operation to be completed */
  status = flash_bank1_operation_wait_for(ERASE_TIMEOUT);

  if(status == FLASH_OPERATE_DONE)
  {
    /* if the previous operation is completed, continue to erase bank1 */
    FLASH->ctrl_bit.bankers = TRUE;
    FLASH->ctrl_bit.erstr = TRUE;

    /* wait for operation to be completed */
    status = flash_bank1_operation_wait_for(ERASE_TIMEOUT);

    /* disable the bankers bit */
    FLASH->ctrl_bit.bankers = FALSE;
  }
  /* return the erase status */
  return status;
}

/**
  * @brief  erase flash bank2 sectors.
  * @param  none
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_bank2_erase(void)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* wait for last operation to be completed */
  status = flash_bank2_operation_wait_for(ERASE_TIMEOUT);

  if(status == FLASH_OPERATE_DONE)
  {
    /* if the previous operation is completed, continue to erase bank2 */
    FLASH->ctrl2_bit.bankers = TRUE;
    FLASH->ctrl2_bit.erstr = TRUE;

    /* wait for operation to be completed */
    status = flash_bank2_operation_wait_for(ERASE_TIMEOUT);

    /* disable the bankers bit */
    FLASH->ctrl2_bit.bankers = FALSE;
  }
  /* return the erase status */
  return status;
}

/**
  * @brief  erase flash spim sectors.
  * @param  none
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_spim_all_erase(void)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* wait for last operation to be completed */
  status = flash_spim_operation_wait_for(SPIM_ERASE_TIMEOUT);

  if(status == FLASH_OPERATE_DONE)
  {
    /* if the previous operation is completed, continue to erase spim */
    FLASH->ctrl3_bit.chpers = TRUE;
    FLASH->ctrl3_bit.erstr = TRUE;

    /* wait for operation to be completed */
    status = flash_spim_operation_wait_for(SPIM_ERASE_TIMEOUT);

    /* disable the chpers bit */
    FLASH->ctrl3_bit.chpers = FALSE;
  }
  /* return the erase status */
  return status;
}

/**
  * @brief  erase the flash user system data.
  * @note   this functions erases all user system data except the fap byte.
  * @param  none
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_user_system_data_erase(void)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  uint16_t fap_val = FAP_RELIEVE_KEY;
  /* get the flash access protection status */
  if(flash_fap_status_get() != RESET)
  {
    fap_val = 0x0000;
  }

  /* wait for last operation to be completed */
  status = flash_operation_wait_for(ERASE_TIMEOUT);

  if(status == FLASH_OPERATE_DONE)
  {
    /* unlock the user system data */
    FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
    FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
    while(FLASH->ctrl_bit.usdulks==RESET);

    /* erase the user system data */
    FLASH->ctrl_bit.usders = TRUE;
    FLASH->ctrl_bit.erstr = TRUE;

    /* wait for operation to be completed */
    status = flash_operation_wait_for(ERASE_TIMEOUT);

    /* disable the usders bit */
    FLASH->ctrl_bit.usders = FALSE;

    if((status == FLASH_OPERATE_DONE) && (fap_val == FAP_RELIEVE_KEY))
    {
      /* enable the user system data programming operation */
      FLASH->ctrl_bit.usdprgm = TRUE;

      /* restore the last flash access protection value */
      USD->fap = (uint16_t)fap_val;

      /* wait for operation to be completed */
      status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

      /*disable the usdprgm bit */
      FLASH->ctrl_bit.usdprgm = FALSE;
    }
  }
  /* return the erase status */
  return status;
}

/**
  * @brief  program a word at a specified address.
  * @param  address: specifies the address to be programmed, word alignment is recommended.
  * @param  data: specifies the data to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_word_program(uint32_t address, uint32_t data)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  if((address >= FLASH_BANK1_START_ADDR) && (address <= FLASH_BANK1_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank1_operation_wait_for(PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl_bit.fprgm = TRUE;
      *(__IO uint32_t*)address = data;
      /* wait for operation to be completed */
      status = flash_bank1_operation_wait_for(PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl_bit.fprgm = FALSE;
    }
  }
  else if((address >= FLASH_BANK2_START_ADDR) && (address <= FLASH_BANK2_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank2_operation_wait_for(PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl2_bit.fprgm = TRUE;
      *(__IO uint32_t*)address = data;
      /* wait for operation to be completed */
      status = flash_bank2_operation_wait_for(PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl2_bit.fprgm = FALSE;
    }
  }
  /* spim : external flash */
  else if(address >= FLASH_SPIM_START_ADDR)
  {
    /* wait for last operation to be completed */
    status = flash_spim_operation_wait_for(SPIM_PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl3_bit.fprgm = TRUE;
      *(__IO uint32_t*)address = data;
      /* wait for operation to be completed */
      status = flash_spim_operation_wait_for(SPIM_PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl3_bit.fprgm = FALSE;
    }
  }

  /* return the program status */
  return status;
}

/**
  * @brief  program a halfword at a specified address.
  * @param  address: specifies the address to be programmed, halfword alignment is recommended.
  * @param  data: specifies the data to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_halfword_program(uint32_t address, uint16_t data)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  if((address >= FLASH_BANK1_START_ADDR) && (address <= FLASH_BANK1_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank1_operation_wait_for(PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl_bit.fprgm = TRUE;
      *(__IO uint16_t*)address = data;
      /* wait for operation to be completed */
      status = flash_bank1_operation_wait_for(PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl_bit.fprgm = FALSE;
    }
  }
  else if((address >= FLASH_BANK2_START_ADDR) && (address <= FLASH_BANK2_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank2_operation_wait_for(PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl2_bit.fprgm = TRUE;
      *(__IO uint16_t*)address = data;
      /* wait for operation to be completed */
      status = flash_bank2_operation_wait_for(PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl2_bit.fprgm = FALSE;
    }
  }
  /* spim : external flash */
  else if(address >= FLASH_SPIM_START_ADDR)
  {
    /* wait for last operation to be completed */
    status = flash_spim_operation_wait_for(SPIM_PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl3_bit.fprgm = TRUE;
      *(__IO uint16_t*)address = data;
      /* wait for operation to be completed */
      status = flash_spim_operation_wait_for(SPIM_PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl3_bit.fprgm = FALSE;
    }
  }

  /* return the program status */
  return status;
}

/**
  * @brief  program a byte at a specified address.
  * @note   this function cannot be used to program spim.
  * @param  address: specifies the address to be programmed.
  * @param  data: specifies the data to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_byte_program(uint32_t address, uint8_t data)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  if((address >= FLASH_BANK1_START_ADDR) && (address <= FLASH_BANK1_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank1_operation_wait_for(PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl_bit.fprgm = TRUE;
      *(__IO uint8_t*)address = data;
      /* wait for operation to be completed */
      status = flash_bank1_operation_wait_for(PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl_bit.fprgm = FALSE;
    }
  }
  else if((address >= FLASH_BANK2_START_ADDR) && (address <= FLASH_BANK2_END_ADDR))
  {
    /* wait for last operation to be completed */
    status = flash_bank2_operation_wait_for(PROGRAMMING_TIMEOUT);

    if(status == FLASH_OPERATE_DONE)
    {
      FLASH->ctrl2_bit.fprgm = TRUE;
      *(__IO uint8_t*)address = data;
      /* wait for operation to be completed */
      status = flash_bank2_operation_wait_for(PROGRAMMING_TIMEOUT);

      /* disable the fprgm bit */
      FLASH->ctrl2_bit.fprgm = FALSE;
    }
  }
  /* return the program status */
  return status;
}

/**
  * @brief  program a halfword at a specified user system data address.
  * @param  address: specifies the address to be programmed.
  * @param  data: specifies the data to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_user_system_data_program(uint32_t address, uint8_t data)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    /* unlock the user system data */
    FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
    FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
    while(FLASH->ctrl_bit.usdulks==RESET);

    /* enable the user system data programming operation */
    FLASH->ctrl_bit.usdprgm = TRUE;
    *(__IO uint16_t*)address = data;

    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

