MarlinFirmware/Marlin/buildroot/share/PlatformIO/framework-arduino-at32f4/system/Drivers/Firmware/src/at32f403a_407_flash.c
    /* disable the usdprgm bit */
    FLASH->ctrl_bit.usdprgm = FALSE;
  }
  /* return the user system data program status */
  return status;
}

/**
  * @brief  return the flash system setting byte status.
  * @param  none
  * @retval values from flash_usd register: wdt_ato_en(bit0), depslp_rst(bit1),
  *         stdby_rst(bit2) and btopt(bit3).
  */
uint8_t flash_ssb_status_get(void)
{
  /* return the system setting byte status */
  return (uint8_t)(FLASH->usd >> 2);
}

/**
  * @brief  enable or disable the specified flash interrupts.
  * @param  flash_int: specifies the flash interrupt sources to be enabled or disabled.
  *         this parameter can be any combination of the following values:
  *         - FLASH_ERR_INT
  *         - FLASH_ODF_INT
  *         - FLASH_BANK1_ERR_INT
  *         - FLASH_BANK1_ODF_INT
  *         - FLASH_BANK2_ERR_INT
  *         - FLASH_BANK2_ODF_INT
  *         - FLASH_SPIM_ERR_INT
  *         - FLASH_SPIM_ODF_INT
  * @param  new_state: new state of the specified flash interrupts.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void flash_interrupt_enable(uint32_t flash_int, confirm_state new_state)
{
  if(flash_int & FLASH_BANK1_ERR_INT)
    FLASH->ctrl_bit.errie = new_state;
  if(flash_int & FLASH_BANK1_ODF_INT)
    FLASH->ctrl_bit.odfie = new_state;
  if(flash_int & FLASH_BANK2_ERR_INT)
    FLASH->ctrl2_bit.errie = new_state;
  if(flash_int & FLASH_BANK2_ODF_INT)
    FLASH->ctrl2_bit.odfie = new_state;
  if(flash_int & FLASH_SPIM_ERR_INT)
    FLASH->ctrl3_bit.errie = new_state;
  if(flash_int & FLASH_SPIM_ODF_INT)
    FLASH->ctrl3_bit.odfie = new_state;
}

/**
  * @brief  select spim supports extended spi flash chip model.
  * @param  mode: the extended spi flash model
  * @retval none
  */
void flash_spim_model_select(flash_spim_model_type mode)
{
  FLASH->select = mode;
}

/**
  * @brief  set the range of encryption in spim flash.
  *         when the address is larger than this value, the writing data will be
  *         directly written to spim without encryption.
  * @param  decode_address: the end address of encrypted data in spim
  * @retval none
  */
void flash_spim_encryption_range_set(uint32_t decode_address)
{
  FLASH->da = decode_address;
}

/**
  * @brief  enable security library function.
  * @param  pwd: slib password
  *         start_sector: security library start sector
  *         data_start_sector: security library d-bus area start sector
  *         end_sector: security library end sector
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_slib_enable(uint32_t pwd, uint16_t start_sector, uint16_t data_start_sector, uint16_t end_sector)
{
  uint32_t slib_range;
  flash_status_type status = FLASH_OPERATE_DONE;
  /* wait for last operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

  /*check range param limits*/
  if((start_sector>=data_start_sector) || ((data_start_sector > end_sector) && \
     (data_start_sector != 0x7FF)) || (start_sector > end_sector))
    return FLASH_PROGRAM_ERROR;

  if(status == FLASH_OPERATE_DONE)
  {
    /* unlock slib cfg register */
    FLASH->slib_unlock = SLIB_UNLOCK_KEY;
    while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);

    slib_range = ((uint32_t)(data_start_sector << 11) & FLASH_SLIB_DATA_START_SECTOR) | \
                 ((uint32_t)(end_sector << 22) & FLASH_SLIB_END_SECTOR) | \
                 (start_sector & FLASH_SLIB_START_SECTOR);
    /* configure slib, set pwd and range */
    FLASH->slib_set_pwd = pwd;
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
    FLASH->slib_set_range = slib_range;
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }
  return status;
}

/**
  * @brief  disable slib when slib enabled.
  * @param  pwd: slib password
  * @retval success or error
  */
error_status flash_slib_disable(uint32_t pwd)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* write password to disable slib */
  FLASH->slib_pwd_clr = pwd;

  status = flash_operation_wait_for(ERASE_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    if(FLASH->slib_misc_sts_bit.slib_pwd_ok)
      return SUCCESS;
    else
      return ERROR;
  }
  return ERROR;
}

/**
 * @brief  get remaining count of slib(range: 256~0).
 * @param  none
 * @retval uint32_t
 */
uint32_t flash_slib_remaining_count_get(void)
{
  return (uint32_t)FLASH->slib_misc_sts_bit.slib_rcnt;
}

/**
  * @brief  get the slib state.
  * @param  none
  * @retval SET or RESET
  */
flag_status flash_slib_state_get(void)
{
  if(FLASH->slib_sts0_bit.slib_enf)
    return SET;
  else
    return RESET;
}

/**
 * @brief  get the start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_start_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_ss;
}

/**
 * @brief  get the data start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_datstart_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_dat_ss;
}

/**
 * @brief  get the end sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_end_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_es;
}

/**
  * @brief  flash crc calibration in main block.
  * @param  start_sector: crc calibration start sector number
  *         sector_cnt: crc calibration sector count
  * @retval uint32: crc calibration result
  */
uint32_t flash_crc_calibrate(uint32_t start_sector, uint32_t sector_cnt)
{
  FLASH->crc_ctrl_bit.crc_ss = start_sector;
  FLASH->crc_ctrl_bit.crc_sn = sector_cnt;
  FLASH->crc_ctrl_bit.crc_strt = TRUE;
  flash_operation_wait_for(OPERATION_TIMEOUT);
  return FLASH->crc_chkr;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
